In [2]:
import pandas as pd

In [3]:
dados = {
    'Nome': ['Ana', 'Bruno', 'Carlos'],
    'Idade': [23, 34, 45],
    'Estado': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte']
}

In [4]:
df = pd.DataFrame(dados)
df

     Nome  Idade          Estado
0     Ana     23       São Paulo
1   Bruno     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte

Acessando dados do Dataframe através da notação de ponto.
Esta notação é válida apenas se o nome da coluna não contiver espaços ou se o nome da coluna não conflitar com nomes de métodos internos do Dataframe

In [5]:
df.Nome

0       Ana
1     Bruno
2    Carlos
Name: Nome, dtype: object

Acessando dados do Dataframe usando a notação de colchetes

In [6]:
df['Idade']

0    23
1    34
2    45
Name: Idade, dtype: int64

Usando colchetes duplos para acessar mais de uma coluna do Dataframe

In [7]:
df[['Nome', 'Idade']]

     Nome  Idade
0     Ana     23
1   Bruno     34
2  Carlos     45

In [8]:
df[['Nome', 'Estado']]

     Nome          Estado
0     Ana       São Paulo
1   Bruno  Rio de Janeiro
2  Carlos  Belo Horizonte

Exemplo prático

In [9]:
#Usando a notação de ponto
print("Coluna 'Nome' usando a notação de ponto:")
print(df.Nome)

Coluna 'Nome' usando a notação de ponto:
0       Ana
1     Bruno
2    Carlos
Name: Nome, dtype: object

In [10]:
#Usando colchetes simples
print("Coluna 'Idade' usando colchetes simples:")
print(df['Idade'])

Coluna 'Idade' usando colchetes simples:
0    23
1    34
2    45
Name: Idade, dtype: int64

In [11]:
#Usando colchetes duplos para múltiplas colunas
print("Colunas 'Nome' e 'Estado' usando colchetes duplos:")
display(df[['Nome', 'Estado']])

Colunas 'Nome' e 'Estado' usando colchetes duplos:

     Nome          Estado
0     Ana       São Paulo
1   Bruno  Rio de Janeiro
2  Carlos  Belo Horizonte

Exemplo prático

In [12]:
dados = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana', 'Eduardo'],
    'Idade': [23, 34, 45, 29, 40],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba', 'Porto Alegre'],
    'Nota': [85, 90, 78, 92, 88]
}

In [13]:
df = pd.DataFrame(dados, index= ['a', 'b', 'c', 'd', 'e'])
print("Dataframe de exemplo:")
df

Dataframe de exemplo:

      Nome  Idade          Cidade  Nota
a      Ana     23       São Paulo    85
b    Bruno     34  Rio de Janeiro    90
c   Carlos     45  Belo Horizonte    78
d    Diana     29        Curitiba    92
e  Eduardo     40    Porto Alegre    88

Selecionando linhas e colunas com *loc*

In [14]:
#Selecionando a linha com indice 'b'
linha_b = df.loc['b']
print("Linha com índice 'b':")
display(linha_b)

Linha com índice 'b':

Nome               Bruno
Idade                 34
Cidade    Rio de Janeiro
Nota                  90
Name: b, dtype: object

Selecionando múltiplas linhas

In [15]:
#Selecionando múltiplas linhas com indices 'a' e 'c'
linhas_ac = df.loc[['a', 'c']] #loc inclui tanto o rótulo inicial quanto o final ao usar fatias
print("Linhas com índices 'a' e 'c':")
display(linhas_ac)

Linhas com índices 'a' e 'c':

     Nome  Idade          Cidade  Nota
a     Ana     23       São Paulo    85
c  Carlos     45  Belo Horizonte    78

**Importante** 

Selecionar uma coluna! Preciso entender isso para fazer split em Dataframes!!!!

In [16]:
#Selecionando a coluna 'Cidade'
coluna_cidade = df.loc[:,'Cidade']
'''
Quando usamos a sintaxe [:] trazemos todos os itens de uma lista.
Na sintaxe df.loc[:, 'Cidade'] nós trazemos com os dois pontos (:) antes da vírgula todas as linhas, e com o nome da coluna 'Cidade' depois da vírgula, só os valores daquela coluna específica.
'''
print("Coluna 'Cidade':")
display(coluna_cidade)

Coluna 'Cidade':

a         São Paulo
b    Rio de Janeiro
c    Belo Horizonte
d          Curitiba
e      Porto Alegre
Name: Cidade, dtype: object

**Importante** 

Selecionar múltiplas colunas! Preciso entender isso para fazer split em Dataframes!!!!

In [17]:
#Selecionando as colunas 'Nome' e 'Nota'
colunas_nome_nota = df.loc[:, ['Nome', 'Nota']]
print("Colunas 'Nome' e 'Nota':")
display(colunas_nome_nota)

Colunas 'Nome' e 'Nota':

      Nome  Nota
a      Ana    85
b    Bruno    90
c   Carlos    78
d    Diana    92
e  Eduardo    88

Selecionar linhas e colunas

In [18]:
df

      Nome  Idade          Cidade  Nota
a      Ana     23       São Paulo    85
b    Bruno     34  Rio de Janeiro    90
c   Carlos     45  Belo Horizonte    78
d    Diana     29        Curitiba    92
e  Eduardo     40    Porto Alegre    88

In [19]:
#Selecionando a linha 'b' e a coluna 'Cidade'
linha_b_cidade = df.loc['b', 'Cidade']
print("Linha 'b' e coluna 'Cidade':")
display(linha_b_cidade)

Linha 'b' e coluna 'Cidade':

'Rio de Janeiro'

In [20]:
#Selecionando as linhas 'a' e 'c' e as colunas 'Nome' e 'Nota'
linhas_as_colunas_Nome_Nota = df.loc[['a', 'c'], ['Nome', 'Nota']]
print("Linhas 'a' e 'c' e colunas 'Nome' e 'Nota':")
display(linhas_as_colunas_Nome_Nota)

Linhas 'a' e 'c' e colunas 'Nome' e 'Nota':

     Nome  Nota
a     Ana    85
c  Carlos    78

Selecionando linhas e colunas com *iloc*

**Tip**

*iloc* usa números como índices -> vamos pensar nesse *i* como inteiro

In [21]:
#Selecionando a primeira linha (indice 0)
linha_0_iloc = df.iloc[0] # == df.loc['a']
print("Primeira linha (indice 0) com iloc:")
display(linha_0_iloc)
linha_0_loc = df.loc['a']
print("Primeira linha (indice 0) com loc:")
display(linha_0_loc)

Primeira linha (indice 0) com iloc:

Nome            Ana
Idade            23
Cidade    São Paulo
Nota             85
Name: a, dtype: object

Primeira linha (indice 0) com loc:

Nome            Ana
Idade            23
Cidade    São Paulo
Nota             85
Name: a, dtype: object

Selecionar múltiplas linhas

In [22]:
#Selecionando as primeiras três linhas (indices 0, 1 e 2)
linhas_012 = df.iloc[0:3] #iloc inclui a posição inicial mas exclui a posição final ao usar fatias.
print("Primeiras três linhas (indices 0, 1 e 2):")
display(linhas_012)

Primeiras três linhas (indices 0, 1 e 2):

     Nome  Idade          Cidade  Nota
a     Ana     23       São Paulo    85
b   Bruno     34  Rio de Janeiro    90
c  Carlos     45  Belo Horizonte    78

Selecionando uma coluna

In [23]:
#Selecionando a primeira coluna
coluna_0 = df.iloc[:,0]
print("Primeira coluna (indice 0):")
display(coluna_0)

Primeira coluna (indice 0):

a        Ana
b      Bruno
c     Carlos
d      Diana
e    Eduardo
Name: Nome, dtype: object

Selecionando múltiplas colunas

In [24]:
#Selecionando as duas primeiras colunas (indices 0 e 1)
colunas_01 = df.iloc[:, 0:2] #iloc inclui a posição inicial mas exclui a posição final ao usar fatias.
print("Primeiras duas colunas (indices 0 e 1):")
display(colunas_01)

Primeiras duas colunas (indices 0 e 1):

      Nome  Idade
a      Ana     23
b    Bruno     34
c   Carlos     45
d    Diana     29
e  Eduardo     40

Selecionar linhas e colunas

In [25]:
#Selecionando a primeira linha e a primeira coluna (índices 0, 0)
linha_0_coluna_0 = df.iloc[0, 0] #== df.loc['a', 'Nome']
print("Primeira linha e primeira coluna (índices 0, 0)")
display(linha_0_coluna_0)

Primeira linha e primeira coluna (índices 0, 0)

'Ana'

In [26]:
df

      Nome  Idade          Cidade  Nota
a      Ana     23       São Paulo    85
b    Bruno     34  Rio de Janeiro    90
c   Carlos     45  Belo Horizonte    78
d    Diana     29        Curitiba    92
e  Eduardo     40    Porto Alegre    88

In [27]:
#Selecionando um registro aleatório
registro_qualquer = df.iloc[2, 2]
print(registro_qualquer)

Belo Horizonte

In [28]:
#Selecionando as primeiras duas linhas e as duas primeiras colunas (índices 0:2, 0:2)
linhas_02_colunas_02 = df.iloc[0:2, 0:2]
print("Primeiras duas linhas e duas primeiras colunas (índices 0:2, 0:2):")
display(linhas_02_colunas_02)

Primeiras duas linhas e duas primeiras colunas (índices 0:2, 0:2):

    Nome  Idade
a    Ana     23
b  Bruno     34

Filtros e seleção condicional no Python

Seleção condicional

Selecionando linhas com base em uma condição

In [29]:
df

      Nome  Idade          Cidade  Nota
a      Ana     23       São Paulo    85
b    Bruno     34  Rio de Janeiro    90
c   Carlos     45  Belo Horizonte    78
d    Diana     29        Curitiba    92
e  Eduardo     40    Porto Alegre    88

In [30]:
#Selecionando linhas onde a idade é maior que 30
filtro_idade = df[df['Idade'] > 30]
print("Linhas onde a idade é maior que 30:")
display(filtro_idade)

Linhas onde a idade é maior que 30:

      Nome  Idade          Cidade  Nota
b    Bruno     34  Rio de Janeiro    90
c   Carlos     45  Belo Horizonte    78
e  Eduardo     40    Porto Alegre    88

In [31]:
df['Idade'] > 30 #cria uma série de valores booleanos indicando quais linhas atendem à condição.

a    False
b     True
c     True
d    False
e     True
Name: Idade, dtype: bool

Selecionando linhas com base em múltiplas condições

In [32]:
#Selecionando linhas onde a idade é maior que 30 e a nota é maior que 85
filtro_combinado = df[(df['Idade'] > 30) & (df['Nota'] > 85)]
print("Linhas onde a idade é maior que 30 e a nota é maior que 85" + "!" * 4 + ":")
display(filtro_combinado)

Linhas onde a idade é maior que 30 e a nota é maior que 85:!!!!

      Nome  Idade          Cidade  Nota
b    Bruno     34  Rio de Janeiro    90
e  Eduardo     40    Porto Alegre    88

Filtrando com *loc*

In [33]:
#Selecionando linhas onde a cidade é 'São Paulo' usando loc
filtro_cidade = df.loc[df['Cidade'] == 'São Paulo']
print("Linhas onde a cidade é 'São Paulo':")
display(filtro_cidade)

Linhas onde a cidade é 'São Paulo':

  Nome  Idade     Cidade  Nota
a  Ana     23  São Paulo    85

Filtrando com funções

In [35]:
#Usando query para selecionar linhas onde a nota é maior que 80 e a cidade não é 'Curitiba'
filtro_query = df.query("Nota > 80 and Cidade != 'Curitiba'")
print("Linhas onde a nota é maior que 80 e a cidade não é 'Curitiba'")
display(filtro_query)

Linhas onde a nota é maior que 80 e a cidade não é 'Curitiba'

      Nome  Idade          Cidade  Nota
a      Ana     23       São Paulo    85
b    Bruno     34  Rio de Janeiro    90
e  Eduardo     40    Porto Alegre    88

Operações e transformaçãoes de dados

Operações aritméticas

In [36]:
from numpy import disp


dados2 = {
    'A': [1, 2, 3, 4],
    'B': [10, 20, 30, 40],
    'C': [100, 200, 300, 400]
}
df2 = pd.DataFrame(dados2)
print("Dataframe de exemplo:")
display(df2)

Dataframe de exemplo:

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [39]:
#Adição
df2['A + B'] = df2['A'] + df2['B']
print("Adição (A + B):")
display(df2)

Adição (A + B):

   A   B    C  A + B
0  1  10  100     11
1  2  20  200     22
2  3  30  300     33
3  4  40  400     44

In [40]:
#Subtração
df2['C - B'] = df2['C'] - df2['B']
print("Subtração (C - B):")
display(df2)

Subtração (C - B):

   A   B    C  A + B  C - B
0  1  10  100     11     90
1  2  20  200     22    180
2  3  30  300     33    270
3  4  40  400     44    360

In [41]:
#Multiplicação
df2['A * 2'] = df2['A'] * 2
print("Multiplicação (A * 2):")
display(df2)

Multiplicação (A * 2):

   A   B    C  A + B  C - B  A * 2
0  1  10  100     11     90      2
1  2  20  200     22    180      4
2  3  30  300     33    270      6
3  4  40  400     44    360      8

In [42]:
#Divisão
df2['B / 2'] = df2['B'] / 2
print("Multiplicação (B / 2):")
display(df2)

Multiplicação (B / 2):

   A   B    C  A + B  C - B  A * 2  B / 2
0  1  10  100     11     90      2    5.0
1  2  20  200     22    180      4   10.0
2  3  30  300     33    270      6   15.0
3  4  40  400     44    360      8   20.0

Aplicar função com *apply*

In [43]:
#Função para elevar ao quadrado
def square(x):
    return x * x

#Aplicando a função a coluna 'A'
df2['A ^ 2'] = df2['A'].apply(square)
print("Aplicar a função (elevar ao quadrado) na coluna 'A':")
display(df2)

Aplicar a função (elevar ao quadrado) na coluna 'A':

   A   B    C  A + B  C - B  A * 2  B / 2  A ^ 2
0  1  10  100     11     90      2    5.0      1
1  2  20  200     22    180      4   10.0      4
2  3  30  300     33    270      6   15.0      9
3  4  40  400     44    360      8   20.0     16

In [45]:
#Elevar ao quadrado usando lambda
#Aplicando a função a coluna 'A'
df2['A ^ 2 lambda'] = df2['A'].apply(lambda x: x * x)
print("Aplicar a função (elevar ao quadrado) na coluna 'A':")
display(df2)

Aplicar a função (elevar ao quadrado) na coluna 'A':

   A   B    C  A + B  C - B  A * 2  B / 2  A ^ 2  A ^ 2 lambda
0  1  10  100     11     90      2    5.0      1             1
1  2  20  200     22    180      4   10.0      4             4
2  3  30  300     33    270      6   15.0      9             9
3  4  40  400     44    360      8   20.0     16            16

Uso de funções *lambda*

In [46]:
#Aplicando uma função lambda para adicionar 10 à coluna 'B'
df2['B + 10'] = df2['B'].apply(lambda x: x + 10)
print("B + 10:")
display(df2)

B + 10:

   A   B    C  A + B  C - B  A * 2  B / 2  A ^ 2  A ^ 2 lambda  B + 10
0  1  10  100     11     90      2    5.0      1             1      20
1  2  20  200     22    180      4   10.0      4             4      30
2  3  30  300     33    270      6   15.0      9             9      40
3  4  40  400     44    360      8   20.0     16            16      50

Manipulação de strings

In [47]:
nome = {
    'Nome': ['Ana', 'Bruno', 'Carlos'],
    'Sobrenome': ['Silva', 'Souza', 'Almeida']
}
df3 = pd.DataFrame(nome)
print("Dataframe de exemplo com strings:")
display(df3)

Dataframe de exemplo com strings:

     Nome Sobrenome
0     Ana     Silva
1   Bruno     Souza
2  Carlos   Almeida

In [48]:
#
df3['Nome completo'] = df3['Nome'] + ' ' + df3['Sobrenome']
print("Concatenar colunas de strings:")
display(df3)

Concatenar colunas de strings:

     Nome Sobrenome   Nome completo
0     Ana     Silva       Ana Silva
1   Bruno     Souza     Bruno Souza
2  Carlos   Almeida  Carlos Almeida

In [49]:
#Convertendo strings em dataframe
#É possível usar os métodos .str.
df3['Nome Maiúsculo'] = df3['Nome'].str.upper()
print("Converter strings para maiúsculo:")
display(df3)

Converter strings para maiúsculo:

     Nome Sobrenome   Nome completo Nome Maiúsculo
0     Ana     Silva       Ana Silva            ANA
1   Bruno     Souza     Bruno Souza          BRUNO
2  Carlos   Almeida  Carlos Almeida         CARLOS

Remoção de dados duplicados

In [57]:
dados3 = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Ana'],
    'Idade': [23, 34, 45, 23]
}
df4 = pd.DataFrame(dados3)
print("Dataframe de exemplocom dados duplicados:")
display(df4)

Dataframe de exemplocom dados duplicados:

     Nome  Idade
0     Ana     23
1   Bruno     34
2  Carlos     45
3     Ana     23

In [58]:
df4.shape

(4, 2)

In [59]:
#Conta o número de registros duplicados
duplicadas = df4.duplicated().sum()
duplicadas

1

In [60]:
df4 = df4.drop_duplicates()
print("Dataframe sem dados duplicados:")
display(df4)

Dataframe sem dados duplicados:

     Nome  Idade
0     Ana     23
1   Bruno     34
2  Carlos     45

Preenchiemento e remoção de valores nulos

In [61]:
outros_dados = {
    'Nome': ['Ana', 'Bruno', 'Carlos'],
    'Idade': [23, None, 45],
    'Cidade': ['São Paulo', 'Rio de Janeiro', None]
}
df5 = pd.DataFrame(outros_dados)
print("Dataframe de exemplo com dados nulos:")
display(df5)

Dataframe de exemplo com dados nulos:

     Nome  Idade          Cidade
0     Ana   23.0       São Paulo
1   Bruno    NaN  Rio de Janeiro
2  Carlos   45.0            None

In [62]:
nulos = df5.isnull().sum()
nulos

Nome      0
Idade     1
Cidade    1
dtype: int64

In [63]:
#Removendo linhas com valores nulos
#Vou criar aqui um novo dataframe sem os valores nulos
df5_semnulos = df5.dropna()
display(df5_semnulos)

  Nome  Idade     Cidade
0  Ana   23.0  São Paulo

In [64]:
#Preenchendo valores nulos com um valor específico
#Ver formas de tratar valores ausentes mais sofisticadas: média, KNN
#df5['Idade'] = df5['Idade'].fillna(0)
df5['Idade'] = df5['Idade'].fillna(df5['Idade'].mean())
print("Usei a média para testar! Foda-se!")
display(df5)

Usei a média! Foda-se!

     Nome  Idade          Cidade
0     Ana   23.0       São Paulo
1   Bruno   34.0  Rio de Janeiro
2  Carlos   45.0            None

In [65]:
df5['Cidade'] = df5['Cidade'].fillna("Desconhecido")
display(df5)

     Nome  Idade          Cidade
0     Ana   23.0       São Paulo
1   Bruno   34.0  Rio de Janeiro
2  Carlos   45.0    Desconhecido